using HomeWork_Collections.Task1;

Console.WriteLine("Homework");
/***
Задание 1:
Напишите программу, используя ArrayList, чтобы хранить информацию о книгах в библиотеке. Ваша программа должна предоставлять следующие функциональности:
1.  Добавление книги: Пользователь может вводить информацию о новой книге, включая название, автора и год издания. Эта информация должна быть добавлена в ArrayList.
2.  Отображение списка книг: Пользователь может просматривать список всех книг в библиотеке, включая название, автора и год издания.
3.  Поиск книги по автору: Пользователь может ввести имя автора, и программа должна отобразить список книг этого автора.
4.  Удаление книги: Пользователь может выбрать книгу из списка и удалить ее из библиотеки.
5.  Выход из программы: Пользователь может завершить программу.
***/
Book testbook = new Book();
testbook.AddBook();