namespace Collections.Methods;

public class MainMethodsOfList
{
    // Add(T) - Добавляет элемент к списку
    // BinarySearch(T) - Выполняет поиск по списку
    // Clear() - Очистка списка
    // Contains(T) - Возвращает true, если список содержит указанный элемент
    // IndexOf(T) - Возвращает индекс переданного элемента
    // ForEach(Action<T>) - Выполняет указанное действие для всех элементов списка
    // Insert(Int32, T) - Вставляет элемент в указанную позицию
    // Find(Predicate<T>) - Осуществляет поиск первого элемента, для которого выполняется заданный предикат
    // Remove(T) - Удаляет указанный элемент из списка
    // RemoveAt(Int32) - Удаляет элемент из заданной позиции
    // Sort() - Сортирует список
    // Reverse() - Меняет порядок расположения элементов в списке на противоположный
}